---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSizeIterator.CurrentObject
source: html/084b59c0-4be0-e552-905d-125a05bb458a.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```